/*
 * ox820-rps unit
 *
 * Written by Sven Bormann
 *
 * This code is licensed under the GPL.
 */

#include "sysbus.h"
#include "net.h"

typedef struct {
    SysBusDevice    busdev;
    MemoryRegion    iomem;
    MemoryRegion    iomem_mac;
    MemoryRegion    iomem_dma;
    MemoryRegion    iomem_netoe;

    qemu_irq        mac_irq;
    qemu_irq        pmt_irq;

    uint32_t        cken;
    uint32_t        rsten;
    uint32_t        phyaddr;

    NICState *nic;
    NICConf conf;

    struct {
        uint32_t        mac_config;                 /* +0x00000 */
        uint32_t        mac_frame_filter;           /* +0x00004 */
        uint32_t        mac_table_high;             /* +0x00008 */
        uint32_t        mac_table_low;              /* +0x0000C */
        uint32_t        gmii_address;               /* +0x00010 */
        uint32_t        gmii_data;                  /* +0x00014 */
        uint32_t        flow_control;               /* +0x00018 */
        uint32_t        vlan_tag;                   /* +0x0001C */
        uint32_t        debug;                      /* +0x00024 */
        uint32_t        wakeup_frame_filter;        /* +0x00028 */
        uint32_t        pmt_control_status;         /* +0x0002C */
        uint32_t        interrupt;                  /* +0x00038 */
        uint32_t        interrupt_mask;             /* +0x0003C */
        struct                                      /* +0x00040 */
        {
            uint32_t    high;
            uint32_t    low;
        } macaddress[32];
        uint32_t        mii_status;                 /* +0x000D8 */
        uint32_t        mmc_cntrl;                  /* +0x00100 */
        uint32_t        mmc_intr_rx;                /* +0x00104 */
        uint32_t        mmc_intr_tx;                /* +0x00108 */
        uint32_t        mmc_intr_mask_rx;           /* +0x0010C */
        uint32_t        mmc_intr_mask_tx;           /* +0x00110 */
        uint32_t        txoctectcount_gb;           /* +0x00114 */
        uint32_t        txframecount_gb;            /* +0x00118 */
        uint32_t        txunderflowerror;           /* +0x00148 */
        uint32_t        txpauseframes;              /* +0x00170 */
        uint32_t        rxframecount_gb;            /* +0x00180 */
        uint32_t        rxoctectcount_gb;           /* +0x00188 */
        uint32_t        rxpauseframes;              /* +0x001D0 */
        uint32_t        timestampcontrol;           /* +0x00700 */
        uint32_t        subsecond_inc;              /* +0x00704 */
        uint32_t        timestamp_low;              /* +0x00708 */
        uint32_t        timestamp_high;             /* +0x0070C */
        uint32_t        timestamp_update_high;      /* +0x00710 */
        uint32_t        timestamp_update_low;       /* +0x00714 */
        uint32_t        timestamp_addend;           /* +0x00718 */
        uint32_t        targettimehigh;             /* +0x0071C */
        uint32_t        targettimelow;              /* +0x00720 */
        uint32_t        timestamp_status;           /* +0x00728 */
        uint32_t        pps_control;                /* +0x0072C */
    } mac;
    struct
    {
        uint32_t        bus_mode;                   /* +0x01000 */
        uint32_t        transmit_poll_demand;       /* +0x01004 */
        uint32_t        receive_poll_demand;        /* +0x01008 */
        uint32_t        receive_desc_list;          /* +0x0100C */
        uint32_t        transmit_desc_list;         /* +0x01010 */
        uint32_t        status;                     /* +0x01014 */
        uint32_t        opmode;                     /* +0x01018 */
        uint32_t        intenable;                  /* +0x0101C */
        uint32_t        miss_frame_and_buf_ovl_cnt; /* +0x01020 */
        uint32_t        rx_int_watchdog_timer;      /* +0x01024 */
        uint32_t        cur_host_tx_desc;           /* +0x01048 */
        uint32_t        cur_host_rx_desc;           /* +0x0104C */
        uint32_t        cur_host_tx_bufaddr;        /* +0x01050 */
        uint32_t        cur_host_rx_bufaddr;        /* +0x01054 */
    } dma;
    struct
    {
        uint32_t        job_queue_baseaddr;         /* +0x10000 */
        uint32_t        job_queue_fill_level;       /* +0x10004 */
        uint32_t        job_queue_read_ptr;         /* +0x10008 */
        uint32_t        job_queue_write_ptr;        /* +0x1000C */
        uint32_t        status;                     /* +0x10018 */
        uint32_t        jobs_completed;             /* +0x1001C */
        uint32_t        bytes_transmitted;          /* +0x10020 */
        uint32_t        packets_transmitted;        /* +0x10024 */
        uint32_t        tx_aborts;                  /* +0x10028 */
        uint32_t        tx_collisions;              /* +0x1002C */
        uint32_t        tx_carrier_errors;          /* +0x10030 */
    } netoe;
} ox820_gmac_state;

static void ox820_gmac_irq_update(ox820_gmac_state* s)
{
    int irqset = 0;
    qemu_set_irq(s->mac_irq, irqset);
    qemu_set_irq(s->pmt_irq, irqset);
}

static void ox820_gmac_mac_phy_address(ox820_gmac_state* s)
{
    if(s->mac.gmii_address & 2)
    {
        /* GMII Write */
    }
    else
    {
        /* GMII read */
        s->mac.gmii_data = 0;
    }
}

static uint64_t ox820_gmac_mac_read(void *opaque, target_phys_addr_t offset,
                                    unsigned size)
{
    ox820_gmac_state *s = (ox820_gmac_state *)opaque;
    uint32_t c = 0;

    offset &= 0xFFF;
    switch (offset >> 2) {
    case 0x0000 >> 2:
        c = s->mac.mac_config;
        break;
    case 0x0004 >> 2:
        c = s->mac.mac_frame_filter;
        break;

    case 0x0008 >> 2:
        c = s->mac.mac_table_high;
        break;

    case 0x000C >> 2:
        c = s->mac.mac_table_low;
